---
kind: type
id: T:Autodesk.Revit.DB.CoordinatePlaneVisibility
source: html/2b8a35d2-832a-ba8a-3d74-4998e6183536.htm
---
# Autodesk.Revit.DB.CoordinatePlaneVisibility

Visibility settings for ReferencePoint element's coordinate reference planes.

## Syntax (C#)
```csharp
public enum CoordinatePlaneVisibility
```